import numpy as np

#данные из таблицы (вариант 19)
xk = np.array([0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1,
               1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2])
yk = np.array([-1.89, -2.07, -2.30, -2.26, -2.34, -2.66, -2.88, -2.85, -3.16, -3.49,
              -3.88, -4.22, -4.45, -4.99, -5.36, -5.71, -6.51, -6.76, -7.35, -8.02])

# Формируем матрицу A и вектор B
A = np.vstack([np.ones(len(xk)), xk, xk ** 2]).T
B = yk

# Решаем систему уравнений
coeffs = np.linalg.lstsq(A, B, rcond=None)[0]

# Коэффициенты многочлена (a, b, c)
a, b, c = coeffs

print(f'Коэффициенты многочлена:\n'
      f'a={a:.4f},\n'
      f'b={b:.4f},\n'
      f'c={c:.4f}')



