import numpy as np

# Исходные данные из таблицы
xk = np.array([0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1,
               1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2])
yk = np.array([-1.86, -1.95, -2.12, -2.06, -2.15, -2.00, -2.12, -2.31, -2.29, -2.57,
              -2.56, -2.86, -2.85, -3.03, -3.25, -3.08, -3.29, -3.67, -3.70, -3.85])

# Формируем матрицу A и вектор B
A = np.vstack([np.ones(len(xk)), xk, xk ** 2]).T
B = yk

# Решаем систему уравнений
coeffs = np.linalg.lstsq(A, B, rcond=None)[0]

# Коэффициенты многочлена (a, b, c)
a, b, c = coeffs

print(f'Коэффициенты многочлена:\n'
      f'a={a:.4f},\n'
      f'b={b:.4f},\n'
      f'c={c:.4f}')